stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32wb0x_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_LL_PWR_H
#define STM32WB0x_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"

/** @addtogroup STM32WB0x_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_MODE_PWR PWR Mode
  * @{
  */
#define LL_PWR_MODE_DEEPSTOP         (0x000000000U)
#define LL_PWR_MODE_SHUTDOWN         (PWR_CR1_LPMS)
/**
  * @}
  */

/** @defgroup PWR_LL_EC_RAMRET RAM Retention enable
  * @{
  */
#define LL_PWR_RAMRET_1              PWR_CR2_RAMRET1
#if defined(PWR_CR2_RAMRET2)
#define LL_PWR_RAMRET_2              PWR_CR2_RAMRET2
#endif /* PWR_CR2_RAMRET2 */
#if defined(PWR_CR2_RAMRET3)
#define LL_PWR_RAMRET_3              PWR_CR2_RAMRET3
#endif /* PWR_CR2_RAMRET3 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDLEVEL PVD Level
  * @{
  */
#define LL_PWR_PVDLEVEL_0            (0x00000000U)                             /*!< VPVD0 around 2.0 V */
#define LL_PWR_PVDLEVEL_1            (PWR_CR2_PVDLS_0)                         /*!< VPVD1 around 2.2 V */
#define LL_PWR_PVDLEVEL_2            (PWR_CR2_PVDLS_1)                         /*!< VPVD2 around 2.4 V */
#define LL_PWR_PVDLEVEL_3            (PWR_CR2_PVDLS_1 | PWR_CR2_PVDLS_0)       /*!< VPVD3 around 2.5 V */
#define LL_PWR_PVDLEVEL_4            (PWR_CR2_PVDLS_2)                         /*!< VPVD4 around 2.6 V */
#define LL_PWR_PVDLEVEL_5            (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_0)       /*!< VPVD5 around 2.8 V */
#define LL_PWR_PVDLEVEL_6            (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_1)       /*!< VPVD6 around 2.9 V */
#define LL_PWR_PVDLEVEL_7            (PWR_CR2_PVDLS)                           /*!< External input analog voltage   (Compare internally to VBGP) */


/**
  * @}
  */

/** @defgroup PWR_LL_EW_SOURCE_PORT IO Port for wakeup source
  * @{
  */
#define LL_PWR_EWS_PORTA             (0x00000000U)             /*!< IO port A to get out from DEEPSTOP mode */
#define LL_PWR_EWS_PORTB             (0x00000001U)             /*!< IO port B to get out from DEEPSTOP mode */
/**
  * @}
  */

/** @defgroup PWR_LL_EW_WAKEUP_SOURCE Wakeup Source
  * @{
  */
#if !defined(PWR_CR6_EWU20)
#define LL_PWR_WAKEUP_CR6_ALL        (0x000000FFU << 16)         /*!< Enable all the wakeup source in CR6            */
#define LL_PWR_WAKEUP_CR3_ALL        (0x0000FFFFU)              /*!< Enable all the wakeup source in CR3            */
#define LL_PWR_WAKEUP_ALL            LL_PWR_WAKEUP_CR6_ALL | LL_PWR_WAKEUP_CR3_ALL
#define LL_PWR_WAKEUP_RTC            PWR_CR3_EIWL              /*!< Enable wakeup on Internal event (RTC)          */
#define LL_PWR_WAKEUP_LPUART         PWR_CR3_EIWL2             /*!< Enable wakeup on Internal event 2 (LPUART)     */
#define LL_PWR_WAKEUP_BLEHOST        PWR_CR3_EWBLEHCPU         /*!< Enable wakeup on BLE Host CPU event            */
#define LL_PWR_WAKEUP_BLE            PWR_CR3_EWBLE             /*!< Enable wakeup on BLE event                     */
#define LL_PWR_WAKEUP_PA11           PWR_CR3_EWU11             /*!< Enable wakeup on PA11 I/O event                */
#define LL_PWR_WAKEUP_PA10           PWR_CR3_EWU10             /*!< Enable wakeup on PA10 I/O event                */
#define LL_PWR_WAKEUP_PA9            PWR_CR3_EWU9              /*!< Enable wakeup on PA9 I/O event                 */
#define LL_PWR_WAKEUP_PA8            PWR_CR3_EWU8              /*!< Enable wakeup on PA8 I/O event                 */
#define LL_PWR_WAKEUP_PA3            (PWR_CR6_EWU15 << 16)     /*!< Enable wakeup on PA3 I/O event                 */
#define LL_PWR_WAKEUP_PA2            (PWR_CR6_EWU14 << 16)     /*!< Enable wakeup on PA2 I/O event                 */
#define LL_PWR_WAKEUP_PA1            (PWR_CR6_EWU13 << 16)     /*!< Enable wakeup on PA1 I/O event                 */
#define LL_PWR_WAKEUP_PA0            (PWR_CR6_EWU12 << 16)     /*!< Enable wakeup on PA0 I/O event                 */
#define LL_PWR_WAKEUP_PB7            PWR_CR3_EWU7              /*!< Enable wakeup on PB7 I/O event                 */
#define LL_PWR_WAKEUP_PB6            PWR_CR3_EWU6              /*!< Enable wakeup on PB6 I/O event                 */
#define LL_PWR_WAKEUP_PB5            PWR_CR3_EWU5              /*!< Enable wakeup on PB5 I/O event                 */
#define LL_PWR_WAKEUP_PB4            PWR_CR3_EWU4              /*!< Enable wakeup on PB4 I/O event                 */
#define LL_PWR_WAKEUP_PB3            PWR_CR3_EWU3              /*!< Enable wakeup on PB3 I/O event                 */
#define LL_PWR_WAKEUP_PB2            PWR_CR3_EWU2              /*!< Enable wakeup on PB2 I/O event                 */
#define LL_PWR_WAKEUP_PB1            PWR_CR3_EWU1              /*!< Enable wakeup on PB1 I/O event                 */
#define LL_PWR_WAKEUP_PB0            PWR_CR3_EWU0              /*!< Enable wakeup on PB0 I/O event                 */
#define LL_PWR_WAKEUP_PB15           (PWR_CR6_EWU19 << 16)     /*!< Enable wakeup on PB15 I/O event                */
#define LL_PWR_WAKEUP_PB14           (PWR_CR6_EWU18 << 16)     /*!< Enable wakeup on PB14 I/O event                */
#define LL_PWR_WAKEUP_PB13           (PWR_CR6_EWU17 << 16)     /*!< Enable wakeup on PB13 I/O event                */
#define LL_PWR_WAKEUP_PB12           (PWR_CR6_EWU16 << 16)     /*!< Enable wakeup on PB12 I/O event                */
#else
#define LL_PWR_WAKEUP_CR6_ALL        (0x0000FFFFU << 16)        /*!< Enable all the wakeup source in CR6            */
#define LL_PWR_WAKEUP_CR3_ALL        (0x0000BFFFU)              /*!< Enable all the wakeup source in CR3            */
#define LL_PWR_WAKEUP_ALL            LL_PWR_WAKEUP_CR6_ALL | LL_PWR_WAKEUP_CR3_ALL
#define LL_PWR_WAKEUP_RTC            PWR_CR3_EIWL              /*!< Enable wakeup on Internal event (RTC)          */
#define LL_PWR_WAKEUP_BLEHOST        PWR_CR3_EWBLEHCPU         /*!< Enable wakeup on BLE Host CPU event            */
#define LL_PWR_WAKEUP_BLE            PWR_CR3_EWBLE             /*!< Enable wakeup on BLE event                     */
#define LL_PWR_WAKEUP_PA15           (PWR_CR6_EWU27 << 16)     /*!< Enable wakeup on PA15 I/O event                */
#define LL_PWR_WAKEUP_PA14           (PWR_CR6_EWU26 << 16)     /*!< Enable wakeup on PA14 I/O event                */
#define LL_PWR_WAKEUP_PA13           (PWR_CR6_EWU25 << 16)     /*!< Enable wakeup on PA13 I/O event                */
#define LL_PWR_WAKEUP_PA12           (PWR_CR6_EWU24 << 16)     /*!< Enable wakeup on PA12 I/O event                */
#define LL_PWR_WAKEUP_PA11           PWR_CR3_EWU11             /*!< Enable wakeup on PA11 I/O event                */
#define LL_PWR_WAKEUP_PA10           PWR_CR3_EWU10             /*!< Enable wakeup on PA10 I/O event                */
#define LL_PWR_WAKEUP_PA9            PWR_CR3_EWU9              /*!< Enable wakeup on PA9 I/O event                 */
#define LL_PWR_WAKEUP_PA8            PWR_CR3_EWU8              /*!< Enable wakeup on PA8 I/O event                 */
#define LL_PWR_WAKEUP_PA7            (PWR_CR6_EWU19 << 16)     /*!< Enable wakeup on LP-PA7 I/O event              */
#define LL_PWR_WAKEUP_PA6            (PWR_CR6_EWU18 << 16)     /*!< Enable wakeup on LP-PA6 I/O event              */
#define LL_PWR_WAKEUP_PA5            (PWR_CR6_EWU17 << 16)     /*!< Enable wakeup on LP-PA5 I/O event              */
#define LL_PWR_WAKEUP_PA4            (PWR_CR6_EWU16 << 16)     /*!< Enable wakeup on LP-PA4 I/O event              */
#define LL_PWR_WAKEUP_PA3            (PWR_CR6_EWU15 << 16)     /*!< Enable wakeup on PA3 I/O event                 */
#define LL_PWR_WAKEUP_PA2            (PWR_CR6_EWU14 << 16)     /*!< Enable wakeup on PA2 I/O event                 */
#define LL_PWR_WAKEUP_PA1            (PWR_CR6_EWU13 << 16)     /*!< Enable wakeup on PA1 I/O event                 */
#define LL_PWR_WAKEUP_PA0            (PWR_CR6_EWU12 << 16)     /*!< Enable wakeup on PA0 I/O event                 */
#define LL_PWR_WAKEUP_PB11           (PWR_CR6_EWU23 << 16)     /*!< Enable wakeup on PB11 I/O event                */
#define LL_PWR_WAKEUP_PB10           (PWR_CR6_EWU22 << 16)     /*!< Enable wakeup on PB10 I/O event                */
#define LL_PWR_WAKEUP_PB9            (PWR_CR6_EWU21 << 16)     /*!< Enable wakeup on PB9 I/O event                 */
#define LL_PWR_WAKEUP_PB8            (PWR_CR6_EWU20 << 16)     /*!< Enable wakeup on PB8 I/O event                 */
#define LL_PWR_WAKEUP_PB7            PWR_CR3_EWU7              /*!< Enable wakeup on PB7 I/O event                 */
#define LL_PWR_WAKEUP_PB6            PWR_CR3_EWU6              /*!< Enable wakeup on PB6 I/O event                 */
#define LL_PWR_WAKEUP_PB5            PWR_CR3_EWU5              /*!< Enable wakeup on PB5 I/O event                 */
#define LL_PWR_WAKEUP_PB4            PWR_CR3_EWU4              /*!< Enable wakeup on PB4 I/O event                 */
#define LL_PWR_WAKEUP_PB3            PWR_CR3_EWU3              /*!< Enable wakeup on PB3 I/O event                 */
#define LL_PWR_WAKEUP_PB2            PWR_CR3_EWU2              /*!< Enable wakeup on PB2 I/O event                 */
#define LL_PWR_WAKEUP_PB1            PWR_CR3_EWU1              /*!< Enable wakeup on PB1 I/O event                 */
#define LL_PWR_WAKEUP_PB0            PWR_CR3_EWU0              /*!< Enable wakeup on PB0 I/O event                 */
#endif /* !defined(PWR_CR6_EWU20) */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO GPIO Port
  * @{
  */
#define LL_PWR_GPIO_A                ((uint32_t)(&(PWR->PUCRA)))
#define LL_PWR_GPIO_B                ((uint32_t)(&(PWR->PUCRB)))

/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_SR1_WUFI                    PWR_SR1_IWUF
#if defined(PWR_CR3_EIWL2)
#define LL_PWR_SR1_WUFI2                   PWR_SR1_IWUF2
#endif /* PWR_CR3_EIWL2 */
#define LL_PWR_SR1_BHWF                    PWR_SR1_WBLEHCPUF
#define LL_PWR_SR1_WBLEF                   PWR_SR1_WBLEF
#define LL_PWR_SR1_WUF0                    PWR_SR1_WUF0
#define LL_PWR_SR1_WUF1                    PWR_SR1_WUF1
#define LL_PWR_SR1_WUF2                    PWR_SR1_WUF2
#define LL_PWR_SR1_WUF3                    PWR_SR1_WUF3
#define LL_PWR_SR1_WUF4                    PWR_SR1_WUF4
#define LL_PWR_SR1_WUF5                    PWR_SR1_WUF5
#define LL_PWR_SR1_WUF6                    PWR_SR1_WUF6
#define LL_PWR_SR1_WUF7                    PWR_SR1_WUF7
#define LL_PWR_SR1_WUF8                    PWR_SR1_WUF8
#define LL_PWR_SR1_WUF9                    PWR_SR1_WUF9
#define LL_PWR_SR1_WUF10                   PWR_SR1_WUF10
#define LL_PWR_SR1_WUF11                   PWR_SR1_WUF11
#define LL_PWR_SR3_WUF12                   (PWR_SR3_WUF12 << 16)
#define LL_PWR_SR3_WUF13                   (PWR_SR3_WUF13 << 16)
#define LL_PWR_SR3_WUF14                   (PWR_SR3_WUF14 << 16)
#define LL_PWR_SR3_WUF15                   (PWR_SR3_WUF15 << 16)
#define LL_PWR_SR3_WUF16                   (PWR_SR3_WUF16 << 16)
#define LL_PWR_SR3_WUF17                   (PWR_SR3_WUF17 << 16)
#define LL_PWR_SR3_WUF18                   (PWR_SR3_WUF18 << 16)
#define LL_PWR_SR3_WUF19                   (PWR_SR3_WUF19 << 16)
#if defined(PWR_CR6_EWU20)
#define LL_PWR_SR3_WUF20                   (PWR_SR3_WUF20 << 16)
#endif /* PWR_CR6_EWU20 */
#if defined(PWR_CR6_EWU21)
#define LL_PWR_SR3_WUF21                   (PWR_SR3_WUF21 << 16)
#endif /* PWR_CR6_EWU21 */
#if defined(PWR_CR6_EWU22)
#define LL_PWR_SR3_WUF22                   (PWR_SR3_WUF22 << 16)
#endif /* PWR_CR6_EWU22 */
#if defined(PWR_CR6_EWU23)
#define LL_PWR_SR3_WUF23                   (PWR_SR3_WUF23 << 16)
#endif /* PWR_CR6_EWU23 */
#if defined(PWR_CR6_EWU24)
#define LL_PWR_SR3_WUF24                   (PWR_SR3_WUF24 << 16)
#endif /* PWR_CR6_EWU24 */
#if defined(PWR_CR6_EWU25)
#define LL_PWR_SR3_WUF25                   (PWR_SR3_WUF25 << 16)
#endif /* PWR_CR6_EWU25 */
#if defined(PWR_CR6_EWU26)
#define LL_PWR_SR3_WUF26                   (PWR_SR3_WUF26 << 16)
#endif /* PWR_CR6_EWU26 */
#if defined(PWR_CR6_EWU27)
#define LL_PWR_SR3_WUF27                   (PWR_SR3_WUF27 << 16)
#endif /* PWR_CR6_EWU27 */
#if defined (PWR_CR3_EIWL2)
#define LL_PWR_SR1_WUFALL                  0x0000FFFF
#else
#define LL_PWR_SR1_WUFALL                  0x0000BFFF
#endif /* PWR_CR3_EIWL2 */
#if defined (PWR_SR3_WUF20)
#define LL_PWR_SR3_WUFALL                  0xFFFF0000
#else
#define LL_PWR_SR3_WUFALL                  0x00FF0000
#endif /* PWR_SR3_WUF20 */
#define LL_PWR_WUFALL                      (LL_PWR_SR1_WUFALL | LL_PWR_SR3_WUFALL)
#define LL_PWR_EXTSRR_RFPHASEF             PWR_EXTSRR_RFPHASEF
#define LL_PWR_EXTSRR_DEEPSTOPF            PWR_EXTSRR_DEEPSTOPF
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO_PIN_MASK PWR GPIO Pin Mask
  * @{
  */
#define LL_PWR_GPIO_BIT_0              (0x0001U)               /*!< GPIO port I/O pin 0  */
#define LL_PWR_GPIO_BIT_1              (0x0002U)               /*!< GPIO port I/O pin 1  */
#define LL_PWR_GPIO_BIT_2              (0x0004U)               /*!< GPIO port I/O pin 2  */
#define LL_PWR_GPIO_BIT_3              (0x0008U)               /*!< GPIO port I/O pin 3  */
#define LL_PWR_GPIO_BIT_4              (0x0010U)               /*!< GPIO port I/O pin 4  */
#define LL_PWR_GPIO_BIT_5              (0x0020U)               /*!< GPIO port I/O pin 5  */
#define LL_PWR_GPIO_BIT_6              (0x0040U)               /*!< GPIO port I/O pin 6  */
#define LL_PWR_GPIO_BIT_7              (0x0080U)               /*!< GPIO port I/O pin 7  */
#define LL_PWR_GPIO_BIT_8              (0x0100U)               /*!< GPIO port I/O pin 8  */
#define LL_PWR_GPIO_BIT_9              (0x0200U)               /*!< GPIO port I/O pin 9  */
#define LL_PWR_GPIO_BIT_10             (0x0400U)               /*!< GPIO port I/O pin 10 */
#define LL_PWR_GPIO_BIT_11             (0x0800U)               /*!< GPIO port I/O pin 11 */
#define LL_PWR_GPIO_BIT_12             (0x1000U)               /*!< GPIO port I/O pin 12 */
#define LL_PWR_GPIO_BIT_13             (0x2000U)               /*!< GPIO port I/O pin 13 */
#define LL_PWR_GPIO_BIT_14             (0x4000U)               /*!< GPIO port I/O pin 14 */
#define LL_PWR_GPIO_BIT_15             (0x8000U)               /*!< GPIO port I/O pin 15 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_CFG IOs PU/PD configuration
  * @{
  */
#define LL_PWR_WUP_RISIEDG      (0x000000000U)                 /*!< Detection of wakeup event on rising edge. */
#define LL_PWR_WUP_FALLEDG      (0x000000001U)                 /*!< Detection of wakeup event on falling edge. */
/**
  * @}
  */

