stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
/** @defgroup PWR_LL_EC_IO_OUT_CFG PA4-PA11 output configuration during DEEPSTOP
  * @{
  */
#define LL_PWR_IOCFG_BYP        (0x000000000U)                 /*!< BYPASS mode. The I/O mode is controlled by the GPIO block
                                                                  registers in active mode and switch to input mode during DEESPTOP state. */
#define LL_PWR_IOCFG_RTC        (0x000000001U)                 /*!< RTC_OUT signal for PA11 and PA8                                        */
#define LL_PWR_IOCFG_LCO        (0x000000001U)                 /*!< LCO output signal for PA10 and PA9                                     */
#define LL_PWR_IOCFG_LOW        (0x000000002U)                 /*!< I/O drives a low level in both active and DEEPSTOP modes               */
#define LL_PWR_IOCFG_HIGH       (0x000000003U)                 /*!< I/O drives a high level in both active and DEEPSTOP modes              */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_LATCH_BOOT PA8-PA11 I/Os value latched at POR.
  * @{
  */
#define LL_PWR_PA8_LATCH_POR    PWR_SR2_IOBOOTVAL_0            /*!< PA8  input value latched at POR. */
#define LL_PWR_PA9_LATCH_POR    PWR_SR2_IOBOOTVAL_1            /*!< PA9  input value latched at POR. */
#define LL_PWR_PA10_LATCH_POR   PWR_SR2_IOBOOTVAL_2            /*!< PA10 input value latched at POR. */
#define LL_PWR_PA11_LATCH_POR   PWR_SR2_IOBOOTVAL_3            /*!< PA11 input value latched at POR. */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_LATCH_BOOT_2 PB12-PB15 I/Os value latched at POR.
  * @{
  */
#if defined(PWR_SR2_IOBOOTVAL2_0)
#define LL_PWR_PB12_LATCH_POR   PWR_SR2_IOBOOTVAL2_0           /*!< PB12  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_0 */
#if defined(PWR_SR2_IOBOOTVAL2_1)
#define LL_PWR_PB13_LATCH_POR   PWR_SR2_IOBOOTVAL2_1           /*!< PB13  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_1 */
#if defined(PWR_SR2_IOBOOTVAL2_2)
#define LL_PWR_PB14_LATCH_POR   PWR_SR2_IOBOOTVAL2_2           /*!< PB14  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_2 */
#if defined(PWR_SR2_IOBOOTVAL2_3)
#define LL_PWR_PB15_LATCH_POR   PWR_SR2_IOBOOTVAL2_3           /*!< PB15  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_3 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_MODE SMPS Mode
  * @{
  */
#define LL_PWR_SMPS             (0x000000000U)                 /*!< SMPS is enabled     */
#define LL_PWR_NO_SMPS          PWR_CR5_NOSMPS                 /*!< SMPS is disabled    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_PRECHARGE_MODE SMPS PRECHARGE Mode
  * @{
  */
#define LL_PWR_NO_SMPS_PRECHARGE    (0x000000000U)             /*!< SMPS not in pecharge mode     */
#define LL_PWR_SMPS_PRECHARGE       PWR_CR5_SMPSFBYP           /*!< SMPS is disabled and bypassed in precharge mode    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_OPEN_MODE SMPS OPEN Mode during DEEPSTOP
  * @{
  */
#define LL_PWR_NO_SMPS_LPOPEN    (0x000000000U)                /*!< In DEEPSTOP, the SMPS is in PRECHARGE mode with output connected to VDDIO */
#define LL_PWR_SMPS_LPOPEN       PWR_CR5_SMPSLPOPEN            /*!< In DEEPSTOP, the SMPS is disabled with floating output                    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_BOM SMPS BOM
  * @{
  */
#define LL_PWR_SMPS_BOM1        (0x000000000U)
#define LL_PWR_SMPS_BOM2        PWR_CR5_SMPSBOMSEL_0
#define LL_PWR_SMPS_BOM3        PWR_CR5_SMPSBOMSEL_1
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_OUTPUT_VOLTAGE_LEVEL SMPS step down converter output voltage scaling voltage level
  * @{
  */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V20              (0x000000000U)                                                   /*!< SMPS step down converter supply output voltage 1.20V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V25              (PWR_CR5_SMPSLVL_0)                                              /*!< SMPS step down converter supply output voltage 1.25V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V30              (PWR_CR5_SMPSLVL_1)                                              /*!< SMPS step down converter supply output voltage 1.30V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V35              (PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)                            /*!< SMPS step down converter supply output voltage 1.35V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40              (PWR_CR5_SMPSLVL_2)                                              /*!< SMPS step down converter supply output voltage 1.40V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V45              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)                            /*!< SMPS step down converter supply output voltage 1.45V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V50              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)                            /*!< SMPS step down converter supply output voltage 1.50V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V55              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)          /*!< SMPS step down converter supply output voltage 1.55V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V60              (PWR_CR5_SMPSLVL_3)                                              /*!< SMPS step down converter supply output voltage 1.60V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V65              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_0)                            /*!< SMPS step down converter supply output voltage 1.65V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V70              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1)                            /*!< SMPS step down converter supply output voltage 1.70V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V75              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)          /*!< SMPS step down converter supply output voltage 1.75V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V80              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2)                            /*!< SMPS step down converter supply output voltage 1.80V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V85              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)          /*!< SMPS step down converter supply output voltage 1.85V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V90              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)          /*!< SMPS step down converter supply output voltage 1.90V */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V95              (PWR_CR5_SMPSLVL)                                                /*!< SMPS step down converter supply output voltage 1.95V */
/**
  * @}
  */

#if defined(PWR_CR5_SMPS_PRECH_CUR_SEL)
/** @defgroup PWR_LL_EC_SMPS_PRECHARGE_LIMIT_CURRENT Select SMPS PRECHARGE limit current
  * @{
  */
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_2_5     (0x000000000U)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_5       (PWR_CR5_SMPS_PRECH_CUR_SEL_0)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_10      (PWR_CR5_SMPS_PRECH_CUR_SEL_1)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_20      (PWR_CR5_SMPS_PRECH_CUR_SEL_0|PWR_CR5_SMPS_PRECH_CUR_SEL_1)
/**
  * @}
  */
#endif /* PWR_CR5_SMPS_PRECH_CUR_SEL */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

