stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
#if defined (PWR_CR3_EIWL2)
/**
  * @brief  Enable Internal Wake-up line (LPUART)
  * @rmtoll CR3          EIWL2          LL_PWR_EnableInternWU2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableInternWU2(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_EIWL2);
}

/**
  * @brief  Disable Internal Wake-up line (LPUART)
  * @rmtoll CR3          EIWL2          LL_PWR_EnableInternWU2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableInternWU2(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_EIWL2);
}

/**
  * @brief  Check if Internal Wake-up line is enabled (LPUART)
  * @rmtoll CR3          EIWL2          LL_PWR_EnableInternWU2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledInternWU2(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_EIWL2) == (PWR_CR3_EIWL2)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Internal Wake-up2 flag
  * @rmtoll SR3          IWUF2        LL_PWR_ClearFlag_BORH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_InternWU2(void)
{
  WRITE_REG(PWR->SR1, PWR_SR1_IWUF2);
}

#endif /* PWR_CR3_EIWL2 */

/**
  * @brief  Enable Wakeup PINx to get out of DEEPSTOP mode.
  * @rmtoll CR3          EWU0         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU1         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU2         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU3         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU4         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU5         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU6         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU7         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU8         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU9         LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU10        LL_PWR_EnableWakeUpPin\n
  *         CR3          EWU11        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU12        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU13        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU14        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU15        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU16        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU17        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU18        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU19        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU20        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU21        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU22        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU23        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU24        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU25        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU26        LL_PWR_EnableWakeUpPin\n
  *         CR6          EWU27        LL_PWR_EnableWakeUpPin
  * @param  WakeUpPin Enable the wakeup sources.
  * This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin(uint32_t WakeUpPin)
{
  SET_BIT(PWR->CR3, (WakeUpPin & 0x0000FFFF));
  SET_BIT(PWR->CR6, (WakeUpPin >> 16));
}

/**
  * @brief  Disable Wakeup PINx to get out of DEEPSTOP mode.
  * @rmtoll CR3          EWU0         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU1         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU2         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU3         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU4         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU5         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU6         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU7         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU8         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU9         LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU10        LL_PWR_DisableWakeUpPin\n
  *         CR3          EWU11        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU12        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU13        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU14        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU15        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU16        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU17        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU18        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU19        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU20        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU21        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU22        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU23        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU24        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU25        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU26        LL_PWR_DisableWakeUpPin\n
  *         CR6          EWU27        LL_PWR_DisableWakeUpPin
  * @param  WakeUpPin Enable the wakeup sources.
  * This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->CR3, (WakeUpPin & 0x0000FFFF));
  CLEAR_BIT(PWR->CR6, (WakeUpPin >> 16));
}

/**
  * @brief  Check if the WakeUp PINx functionality is enabled
  * @rmtoll CR3          EWU0         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU1         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU2         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU3         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU4         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU5         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU6         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU7         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU8         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU9         LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU10        LL_PWR_IsEnabledWakeUpPin\n
  *         CR3          EWU11        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU12        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU13        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU14        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU15        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU16        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU17        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU18        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU19        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU20        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU21        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU22        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU23        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU24        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU25        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU26        LL_PWR_IsEnabledWakeUpPin\n
  *         CR6          EWU27        LL_PWR_IsEnabledWakeUpPin
  * @param  WakeUpPin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin(uint32_t WakeUpPin)
{
  return ((READ_BIT(PWR->CR3, (WakeUpPin & 0x0000FFFF)) == (WakeUpPin & 0x0000FFFF)) &&
          (READ_BIT(PWR->CR6, (WakeUpPin >> 16)) == (WakeUpPin >> 16)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin polarity low for the event detection
  * @rmtoll CR4          WUP0         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP1         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP2         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP3         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP4         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP5         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP6         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP7         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP8         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP9         LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP10        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR4          WUP11        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP12        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP13        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP14        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP15        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP16        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP17        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP18        LL_PWR_SetWakeUpPinPolarityLow\n
  *         CR7          WUP19        LL_PWR_SetWakeUpPinPolarityLow
  * @param  WakeUpPin Pin to configure. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  SET_BIT(PWR->CR4, (WakeUpPin & 0x0000FFFF));
  SET_BIT(PWR->CR7, (WakeUpPin >> 16));

