stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
}

/**
  * @brief  Set the Wake-Up pin polarity high for the event detection
  * @rmtoll CR4          WUP0         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP1         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP2         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP3         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP4         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP5         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP6         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP7         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP8         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP9         LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP10        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR4          WUP11        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP12        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP13        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP14        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP15        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP16        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP17        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP18        LL_PWR_SetWakeUpPinPolarityHigh\n
  *         CR7          WUP19        LL_PWR_SetWakeUpPinPolarityHigh
  * @param  WakeUpPin Pin to configure. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->CR4, (WakeUpPin & 0x0000FFFF));
  CLEAR_BIT(PWR->CR7, (WakeUpPin >> 16));

}

/**
  * @brief  Get the polarity for the I/Os wakeup sources.
  * @rmtoll CR4          WUP0         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP1         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP2         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP3         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP4         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP5         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP6         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP7         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP8         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP9         LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP10        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR4          WUP11        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP12        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP13        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP14        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP15        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP16        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP17        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP18        LL_PWR_IsWakeUpPinPolarityLow\n
  *         CR7          WUP19        LL_PWR_IsWakeUpPinPolarityLow
  * @param  WakeUpPin Pin to configure. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PA0
  *         @arg @ref LL_PWR_WAKEUP_PA1
  *         @arg @ref LL_PWR_WAKEUP_PA2
  *         @arg @ref LL_PWR_WAKEUP_PA3
  *         @arg @ref LL_PWR_WAKEUP_PA4 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA5 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA6 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA7 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA8
  *         @arg @ref LL_PWR_WAKEUP_PA9
  *         @arg @ref LL_PWR_WAKEUP_PA10
  *         @arg @ref LL_PWR_WAKEUP_PA11
  *         @arg @ref LL_PWR_WAKEUP_PA12 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA13 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA14 (*)
  *         @arg @ref LL_PWR_WAKEUP_PA15 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB0
  *         @arg @ref LL_PWR_WAKEUP_PB1
  *         @arg @ref LL_PWR_WAKEUP_PB2
  *         @arg @ref LL_PWR_WAKEUP_PB3
  *         @arg @ref LL_PWR_WAKEUP_PB4
  *         @arg @ref LL_PWR_WAKEUP_PB5
  *         @arg @ref LL_PWR_WAKEUP_PB6
  *         @arg @ref LL_PWR_WAKEUP_PB7
  *         @arg @ref LL_PWR_WAKEUP_PB8 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB9 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB10 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB11 (*)
  *         @arg @ref LL_PWR_WAKEUP_PB12 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB13 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB14 (**)
  *         @arg @ref LL_PWR_WAKEUP_PB15 (**)
  *        (*) available only on STM32WB06 and STM32WB07 devices
  *        (**) available only on STM32WB05 and STM32WB09 devices
  * @retval None
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  if (WakeUpPin & 0x0000FFFF)
  {
    return (uint32_t)((READ_BIT(PWR->CR4, (WakeUpPin & 0x0000FFFF))) ? 1UL : 0UL);
  }
  else
  {
    return (uint32_t)((READ_BIT(PWR->CR7, (WakeUpPin >> 16))) ? 1UL : 0UL);
  }

