stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
}

/**
  * @brief  Enable wakeup on BLE event.
  * @rmtoll CR3          EWBLE         LL_PWR_EnableWU_EWBLE
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWU_EWBLE(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_EWBLE);
}

/**
  * @brief  Enable wakeup on BLE Host CPU event.
  * @rmtoll CR3          EWBLEHCPU         LL_PWR_EnableWU_EWBLEHCPU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWU_EWBLEHCPU(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_EWBLEHCPU);
}

/**
  * @brief  Disable wakeup on BLE Host CPU event.
  * @rmtoll CR3          EWBLE         LL_PWR_DisableWU_EWBLE
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWU_EWBLE(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_EWBLE);
}

/**
  * @brief  Disable wakeup on BLE Host CPU event.
  * @rmtoll CR3          EWBLEHCPU         LL_PWR_DisableWU_EWBLEHCPU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWU_EWBLEHCPU(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_EWBLEHCPU);
}

/**
  * @brief  Check if the wakeup BLE is enabled
  * @rmtoll CR3          EWBLE         LL_PWR_IsEnabledWU_EWBLE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWU_EWBLE(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_EWBLE) == (PWR_CR3_EWBLE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the wakeup BLE Host CPU is enabled
  * @rmtoll CR3          EWBLEHCPU         LL_PWR_IsEnabledWU_EWBLEHCPU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWU_EWBLEHCPU(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_EWBLEHCPU) == (PWR_CR3_EWBLEHCPU)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup PWR_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get Internal Wake-up line Flag (RTC)
  * @rmtoll SR1          IWUF          LL_PWR_IsActiveFlag_InternWU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_InternWU(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_IWUF) == (PWR_SR1_IWUF)) ? 1UL : 0UL);
}

#if defined(PWR_CR3_EIWL2)
/**
  * @brief  Get Internal Wake-up line Flag (LPUART)
  * @rmtoll SR1          IWUF2          LL_PWR_IsActiveFlag_InternWU2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_InternWU2(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_IWUF2) == (PWR_SR1_IWUF2)) ? 1UL : 0UL);
}
#endif /* PWR_CR3_EIWL2 */

/**
  * @brief  Get Wake-up Flag 0
  * @rmtoll SR1          WUF0          LL_PWR_IsActiveFlag_WU0
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU0(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF0) == (PWR_SR1_WUF0)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 1
  * @rmtoll SR1          WUF1          LL_PWR_IsActiveFlag_WU1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU1(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF1) == (PWR_SR1_WUF1)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 2
  * @rmtoll SR1          WUF2          LL_PWR_IsActiveFlag_WU2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU2(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF2) == (PWR_SR1_WUF2)) ? 1UL : 0UL);
}
/**
  * @brief  Get Wake-up Flag 3
  * @rmtoll SR1          WUF3          LL_PWR_IsActiveFlag_WU3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU3(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF3) == (PWR_SR1_WUF3)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 4
  * @rmtoll SR1          WUF4          LL_PWR_IsActiveFlag_WU4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU4(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF4) == (PWR_SR1_WUF4)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 5
  * @rmtoll SR1          WUF5          LL_PWR_IsActiveFlag_WU5
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU5(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF5) == (PWR_SR1_WUF5)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 6
  * @rmtoll SR1          WUF6          LL_PWR_IsActiveFlag_WU6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU6(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF6) == (PWR_SR1_WUF6)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 7
  * @rmtoll SR1          WUF7          LL_PWR_IsActiveFlag_WU7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU7(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF7) == (PWR_SR1_WUF7)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 8
  * @rmtoll SR1          WUF8         LL_PWR_IsActiveFlag_WU8
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU8(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF8) == (PWR_SR1_WUF8)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 9
  * @rmtoll SR1          WUF9          LL_PWR_IsActiveFlag_WU9
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU9(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF9) == (PWR_SR1_WUF9)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 10
  * @rmtoll SR1          WUF10          LL_PWR_IsActiveFlag_WU10
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU10(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF10) == (PWR_SR1_WUF10)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 11
  * @rmtoll SR1          WUF11          LL_PWR_IsActiveFlag_WU11
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU11(void)
{
  return ((READ_BIT(PWR->SR1, PWR_SR1_WUF11) == (PWR_SR1_WUF11)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 12
  * @rmtoll SR3          WUF12          LL_PWR_IsActiveFlag_WU12
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU12(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF12) == (PWR_SR3_WUF12)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 13
  * @rmtoll SR3          WUF13          LL_PWR_IsActiveFlag_WU13
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU13(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF13) == (PWR_SR3_WUF13)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 14
  * @rmtoll SR3          WUF14          LL_PWR_IsActiveFlag_WU14
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU14(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF14) == (PWR_SR3_WUF14)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 15
  * @rmtoll SR3          WUF15          LL_PWR_IsActiveFlag_WU15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU15(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF15) == (PWR_SR3_WUF15)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 16
  * @rmtoll SR3          WUF16          LL_PWR_IsActiveFlag_WU16
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU16(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF16) == (PWR_SR3_WUF16)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 17
  * @rmtoll SR3          WUF17          LL_PWR_IsActiveFlag_WU17
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU17(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF17) == (PWR_SR3_WUF17)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 18
  * @rmtoll SR3          WUF18          LL_PWR_IsActiveFlag_WU18
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU18(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF18) == (PWR_SR3_WUF18)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 19
  * @rmtoll SR3          WUF19          LL_PWR_IsActiveFlag_WU19
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU19(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF19) == (PWR_SR3_WUF19)) ? 1UL : 0UL);
}

