stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_pwr.h
#if defined (PWR_CR6_EWU20)
/**
  * @brief  Get Wake-up Flag 20
  * @rmtoll SR3          WUF20          LL_PWR_IsActiveFlag_WU20
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU20(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF20) == (PWR_SR3_WUF20)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU20 */

#if defined (PWR_CR6_EWU21)
/**
  * @brief  Get Wake-up Flag 21
  * @rmtoll SR3          WUF21          LL_PWR_IsActiveFlag_WU21
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU21(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF21) == (PWR_SR3_WUF21)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU21 */

#if defined (PWR_CR6_EWU22)
/**
  * @brief  Get Wake-up Flag 22
  * @rmtoll SR3          WUF22          LL_PWR_IsActiveFlag_WU22
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU22(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF22) == (PWR_SR3_WUF22)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU22 */

#if defined (PWR_CR6_EWU23)
/**
  * @brief  Get Wake-up Flag 23
  * @rmtoll SR3          WUF23          LL_PWR_IsActiveFlag_WU23
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU23(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF23) == (PWR_SR3_WUF23)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU23 */

#if defined (PWR_CR6_EWU24)
/**
  * @brief  Get Wake-up Flag 24
  * @rmtoll SR3          WUF24          LL_PWR_IsActiveFlag_WU23
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU24(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF24) == (PWR_SR3_WUF24)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU24 */

#if defined (PWR_CR6_EWU25)
/**
  * @brief  Get Wake-up Flag 23
  * @rmtoll SR3          WUF25          LL_PWR_IsActiveFlag_WU25
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU25(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF25) == (PWR_SR3_WUF25)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU25 */

#if defined (PWR_CR6_EWU26)
/**
  * @brief  Get Wake-up Flag 26
  * @rmtoll SR3          WUF26          LL_PWR_IsActiveFlag_WU26
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU26(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF26) == (PWR_SR3_WUF26)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU26 */

#if defined (PWR_CR6_EWU27)
/**
  * @brief  Get Wake-up Flag 27
  * @rmtoll SR3          WUF27          LL_PWR_IsActiveFlag_WU27
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU27(void)
{
  return ((READ_BIT(PWR->SR3, PWR_SR3_WUF27) == (PWR_SR3_WUF27)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_EWU27 */

/**
  * @brief  Get which source woken up the device after a DEEPSTOP.
  * @rmtoll SR1          WUFI           LL_PWR_GetWakeupSource\n
  *         SR1          WUFI2          LL_PWR_GetWakeupSource\n
  *         SR1          BHWF           LL_PWR_GetWakeupSource\n
  *         SR1          WBLEF          LL_PWR_GetWakeupSource\n
  *         SR1          WUF0           LL_PWR_GetWakeupSource\n
  *         SR1          WUF1           LL_PWR_GetWakeupSource\n
  *         SR1          WUF2           LL_PWR_GetWakeupSource\n
  *         SR1          WUF3           LL_PWR_GetWakeupSource\n
  *         SR1          WUF4           LL_PWR_GetWakeupSource\n
  *         SR1          WUF5           LL_PWR_GetWakeupSource\n
  *         SR1          WUF6           LL_PWR_GetWakeupSource\n
  *         SR1          WUF7           LL_PWR_GetWakeupSource\n
  *         SR1          WUF8           LL_PWR_GetWakeupSource\n
  *         SR1          WUF9           LL_PWR_GetWakeupSource\n
  *         SR1          WUF10          LL_PWR_GetWakeupSource\n
  *         SR1          WUF11          LL_PWR_GetWakeupSource\n
  *         SR3          WUF12          LL_PWR_GetWakeupSource\n
  *         SR3          WUF13          LL_PWR_GetWakeupSource\n
  *         SR3          WUF14          LL_PWR_GetWakeupSource\n
  *         SR3          WUF15          LL_PWR_GetWakeupSource\n
  *         SR3          WUF16          LL_PWR_GetWakeupSource\n
  *         SR3          WUF17          LL_PWR_GetWakeupSource\n
  *         SR3          WUF18          LL_PWR_GetWakeupSource\n
  *         SR3          WUF19          LL_PWR_GetWakeupSource\n
  *         SR3          WUF20          LL_PWR_GetWakeupSource\n
  *         SR3          WUF21          LL_PWR_GetWakeupSource\n
  *         SR3          WUF22          LL_PWR_GetWakeupSource\n
  *         SR3          WUF23          LL_PWR_GetWakeupSource\n
  *         SR3          WUF24          LL_PWR_GetWakeupSource\n
  *         SR3          WUF25          LL_PWR_GetWakeupSource\n
  *         SR3          WUF26          LL_PWR_GetWakeupSource\n
  *         SR3          WUF27          LL_PWR_GetWakeupSource
  * @retval Wakeup Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SR1_WUFI
  *         @arg @ref LL_PWR_SR1_WUFI2 (**)
  *         @arg @ref LL_PWR_SR1_BHWF
  *         @arg @ref LL_PWR_SR1_WBLEF
  *         @arg @ref LL_PWR_SR1_WUF0
  *         @arg @ref LL_PWR_SR1_WUF1
  *         @arg @ref LL_PWR_SR1_WUF2
  *         @arg @ref LL_PWR_SR1_WUF3
  *         @arg @ref LL_PWR_SR1_WUF4
  *         @arg @ref LL_PWR_SR1_WUF5
  *         @arg @ref LL_PWR_SR1_WUF6
  *         @arg @ref LL_PWR_SR1_WUF7
  *         @arg @ref LL_PWR_SR1_WUF8
  *         @arg @ref LL_PWR_SR1_WUF9
  *         @arg @ref LL_PWR_SR1_WUF10
  *         @arg @ref LL_PWR_SR1_WUF11
  *         @arg @ref LL_PWR_SR3_WUF12
  *         @arg @ref LL_PWR_SR3_WUF13
  *         @arg @ref LL_PWR_SR3_WUF14
  *         @arg @ref LL_PWR_SR3_WUF15
  *         @arg @ref LL_PWR_SR3_WUF16
  *         @arg @ref LL_PWR_SR3_WUF17
  *         @arg @ref LL_PWR_SR3_WUF18
  *         @arg @ref LL_PWR_SR3_WUF19
  *         @arg @ref LL_PWR_SR3_WUF20 (*)
  *         @arg @ref LL_PWR_SR3_WUF21 (*)
  *         @arg @ref LL_PWR_SR3_WUF22 (*)
  *         @arg @ref LL_PWR_SR3_WUF23 (*)
  *         @arg @ref LL_PWR_SR3_WUF24 (*)
  *         @arg @ref LL_PWR_SR3_WUF25 (*)
  *         @arg @ref LL_PWR_SR3_WUF26 (*)
  *         @arg @ref LL_PWR_SR3_WUF27 (*)
  *         (*) Not available on devices STM32WB05 and STM32WB09
  *         (**) Not available on devices STM32WB07
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeupSource(void)
{
  uint32_t wakeup_source;

  wakeup_source = READ_REG(PWR->SR1) & 0x0000FFFF;
  return (uint32_t)(wakeup_source | (READ_REG(PWR->SR3) << 16));
}

/**
  * @brief   Clear Wake-up Flags.
  * @rmtoll  SR1          WUFI2          LL_PWR_ClearFlag_WU\n
  *          SR1          BHWF           LL_PWR_ClearFlag_WU\n
  *          SR1          WBLEF          LL_PWR_ClearFlag_WU\n
  *          SR1          WUF0           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF1           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF2           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF3           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF4           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF5           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF6           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF7           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF8           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF9           LL_PWR_ClearFlag_WU\n
  *          SR1          WUF10          LL_PWR_ClearFlag_WU\n
  *          SR1          WUF11          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF12          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF13          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF14          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF15          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF16          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF17          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF18          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF19          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF20          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF21          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF22          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF23          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF24          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF25          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF26          LL_PWR_ClearFlag_WU\n
  *          SR3          WUF27          LL_PWR_ClearFlag_WU
  * @param  source Wakeup Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_SR1_WUFI2 (**)
  *         @arg @ref LL_PWR_SR1_BHWF
  *         @arg @ref LL_PWR_SR1_WBLEF
  *         @arg @ref LL_PWR_SR1_WUF0
  *         @arg @ref LL_PWR_SR1_WUF1
  *         @arg @ref LL_PWR_SR1_WUF2
  *         @arg @ref LL_PWR_SR1_WUF3
  *         @arg @ref LL_PWR_SR1_WUF4
  *         @arg @ref LL_PWR_SR1_WUF5
  *         @arg @ref LL_PWR_SR1_WUF6
  *         @arg @ref LL_PWR_SR1_WUF7
  *         @arg @ref LL_PWR_SR1_WUF8
  *         @arg @ref LL_PWR_SR1_WUF9
  *         @arg @ref LL_PWR_SR1_WUF10
  *         @arg @ref LL_PWR_SR1_WUF11
  *         @arg @ref LL_PWR_SR3_WUF12
  *         @arg @ref LL_PWR_SR3_WUF13
  *         @arg @ref LL_PWR_SR3_WUF14
  *         @arg @ref LL_PWR_SR3_WUF15
  *         @arg @ref LL_PWR_SR3_WUF16
  *         @arg @ref LL_PWR_SR3_WUF17
  *         @arg @ref LL_PWR_SR3_WUF18
  *         @arg @ref LL_PWR_SR3_WUF19
  *         @arg @ref LL_PWR_SR3_WUF20 (*)
  *         @arg @ref LL_PWR_SR3_WUF21 (*)
  *         @arg @ref LL_PWR_SR3_WUF22 (*)
  *         @arg @ref LL_PWR_SR3_WUF23 (*)
  *         @arg @ref LL_PWR_SR3_WUF24 (*)
  *         @arg @ref LL_PWR_SR3_WUF25 (*)
  *         @arg @ref LL_PWR_SR3_WUF26 (*)
  *         @arg @ref LL_PWR_SR3_WUF27 (*)
  *         (*) Not available on devices STM32WB05 and STM32WB09
  *         (**) Not available on devices STM32WB07
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearWakeupSource(uint32_t source)
{
  WRITE_REG(PWR->SR1, (source & 0x0000FFFF));
  WRITE_REG(PWR->SR3, (source >> 16));
}

/**
  * @brief   Clear Wake-up Flag 0.
  * @rmtoll SR1          WUF0         LL_PWR_ClearFlag_WU0
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU0()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF0);
}

/**
  * @brief   Clear Wake-up Flag 1.
  * @rmtoll SR1          WUF1         LL_PWR_ClearFlag_WU1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU1()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF1);
}


/**
  * @brief   Clear Wake-up Flag 2.
  * @rmtoll SR1          WUF2         LL_PWR_ClearFlag_WU2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU2()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF2);
}

/**
  * @brief   Clear Wake-up Flag 3.
  * @rmtoll SR1          WUF3         LL_PWR_ClearFlag_WU3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU3()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF3);
}

/**
  * @brief   Clear Wake-up Flag 4.
  * @rmtoll SR1          WUF4         LL_PWR_ClearFlag_WU4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU4()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF4);
}

/**
  * @brief   Clear Wake-up Flag 5.
  * @rmtoll SR1          WUF5         LL_PWR_ClearFlag_WU5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU5()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF5);
}

/**
  * @brief   Clear Wake-up Flag 6.
  * @rmtoll SR1          WUF6         LL_PWR_ClearFlag_WU6
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU6()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF6);
}

/**
  * @brief   Clear Wake-up Flag 7.
  * @rmtoll SR1          WUF5         LL_PWR_ClearFlag_WU7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU7()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF7);
}

/**
  * @brief   Clear Wake-up Flag 8.
  * @rmtoll SR1          WUF5         LL_PWR_ClearFlag_WU8
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU8()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF8);
}

/**
  * @brief   Clear Wake-up Flag 9.
  * @rmtoll SR1          WUF9         LL_PWR_ClearFlag_WU9
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU9()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF9);
}

/**
  * @brief   Clear Wake-up Flag 10.
  * @rmtoll SR1          WUF10         LL_PWR_ClearFlag_WU10
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU10()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF10);
}

/**
  * @brief   Clear Wake-up Flag 11.
  * @rmtoll SR1          WUF11         LL_PWR_ClearFlag_WU11
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU11()
{
  WRITE_REG(PWR->SR1, PWR_SR1_WUF11);
}

/**
  * @brief   Clear Wake-up Flag 12.
  * @rmtoll SR3          WUF12         LL_PWR_ClearFlag_WU12
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU12()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF12);
}

/**
  * @brief   Clear Wake-up Flag 13.
  * @rmtoll SR3          WUF13         LL_PWR_ClearFlag_WU13
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU13()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF13);
}

/**
  * @brief   Clear Wake-up Flag 14.
  * @rmtoll SR3          WUF14         LL_PWR_ClearFlag_WU14
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU14()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF14);
}

/**
  * @brief   Clear Wake-up Flag 15.
  * @rmtoll SR3          WUF15         LL_PWR_ClearFlag_WU15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU15()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF15);
}

/**
  * @brief   Clear Wake-up Flag 16.
  * @rmtoll SR3          WUF16         LL_PWR_ClearFlag_WU16
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU16()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF16);
}

/**
  * @brief   Clear Wake-up Flag 17.
  * @rmtoll SR3          WUF17         LL_PWR_ClearFlag_WU17
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU17()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF17);
}

/**
  * @brief   Clear Wake-up Flag 18.
  * @rmtoll SR3          WUF18         LL_PWR_ClearFlag_WU18
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU18()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF18);
}

/**
  * @brief   Clear Wake-up Flag 19.
  * @rmtoll SR3          WUF19         LL_PWR_ClearFlag_WU19
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU19()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF19);
}

#if defined(PWR_CR6_EWUP20)
/**
  * @brief   Clear Wake-up Flag 20.
  * @rmtoll SR3          WUF20         LL_PWR_ClearFlag_WU20
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU20()
{
  WRITE_REG(PWR->SR3, PWR_SR3_WUF20);
}
#endif /* PWR_CR6_EWUP20 */

